Books_And_Tutorials/DotNet/deadlock/deadlock_in_csharp.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Scenarios for Deadlock in C# </title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-26 13:54:02 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Scenarios for Deadlock in C# </h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../../CSS/org-style.css" type="text/css" />
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 01-12-2013</p>
</div>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Mutual Exclusion </a></li>
<li><a href="#sec-2">2 Reentrant </a></li>
<li><a href="#sec-3">3 Locking  <i>this</i>. </a></li>
<li><a href="#sec-4">4 Locking <i>typeof</i>. </a></li>
<li><a href="#sec-5">5 Locking <i>String</i> </a></li>
<li><a href="#sec-6">6 Circular Wait </a></li>
<li><a href="#sec-7">7 When a thread terminated ungracefully after acquiring the monitor and without releasing  it. </a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mutual Exclusion </h2>
<div class="outline-text-2" id="text-1">


<p>
Example in case of UI, there is only one UI Thread if other non-ui threads
wants to manipulate the UI controls they have to dispatch the task to
the UI thread. If the task stucks/waits for something infinitely than
deadlock can occur.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Reentrant </h2>
<div class="outline-text-2" id="text-2">


<p>
<b>Example</b>
</p>



<pre class="src src-csharp">ThreadOne()
  <span style="color: #268bd2;">lock</span>(a){
    <span style="color: #268bd2;">lock</span>(b){
      ..
    }
  }
}

<span style="color: #268bd2;">ThreadTwo</span>()
  <span style="color: #268bd2;">lock</span>(b){
    <span style="color: #268bd2;">lock</span>(a){
      ..
    }
  }
}
</pre>




<p>
If one thread enters into critical section acquiring  syncroot  a and try to
enter another critical section by acquiring syncroot b while other thread has
already entered his critical section by acquiring sychroot b and trying to
enter another critical section by acquiring lock on sync root b 
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Locking  <i>this</i>. </h2>
<div class="outline-text-2" id="text-3">


<p>
If the class is publicly accessible deadlock can occur in scenario when
it is locking using this in one function while other class is unaware
and uses its instance as syncroot in other class for locking.
</p>



<pre class="src src-csharp"><span style="color: #859900;">class</span> <span style="color: #b58900;">A</span>
{
   <span style="color: #268bd2;">func</span>()
   {
     <span style="color: #268bd2;">lock</span>(<span style="color: #859900;">this</span>){
       .....
     }
   }
} 

<span style="color: #859900;">class</span> <span style="color: #b58900;">B</span>
{
  <span style="color: #b58900;">A</span> <span style="color: #268bd2;">_instanceOfA</span> = <span style="color: #859900;">new</span> <span style="color: #b58900;">A</span>();
  <span style="color: #268bd2;">func</span>()
  {
    <span style="color: #268bd2;">lock</span>(_instanceOfA){
      .....
    }
  }
} 
</pre>



</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Locking <i>typeof</i>. </h2>
<div class="outline-text-2" id="text-4">


<p>
If the class say A is publicly accessible deadlock can occur in scenario when
it is locking using typeof its type  in one function while other class
is unaware and used the  type of class A to lock  .
</p>
<p>
There is only one reference for typeof
</p>



<pre class="src src-csharp"><span style="color: #859900;">class</span> <span style="color: #b58900;">A</span>
{
   <span style="color: #859900;">static</span> func()
   {
     <span style="color: #268bd2;">lock</span>(<span style="color: #859900;">typeof</span>(<span style="color: #b58900;">A</span>)){
       .....
     }
   }
} 

<span style="color: #859900;">static</span> <span style="color: #859900;">class</span> <span style="color: #b58900;">B</span>
{  
  <span style="color: #268bd2;">func</span>()
  {
    <span style="color: #268bd2;">lock</span>(<span style="color: #859900;">typeof</span>(<span style="color: #b58900;">A</span>)){
      .....
    }
  }
}
</pre>




</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Locking <i>String</i> </h2>
<div class="outline-text-2" id="text-5">


<p>
String are interned, i.e. single literal value and all the string instance
referring it (through out the process). 
So if there is
string a = "mystr" and  string b = "mystr".
both a and b will refer to same literal mystr.
</p>


<pre class="src src-csharp"><span style="color: #b58900;">string</span> <span style="color: #268bd2;">str1</span> = <span style="color: #2aa198;">"mystr"</span>;
<span style="color: #b58900;">string</span> <span style="color: #268bd2;">str2</span> = <span style="color: #2aa198;">"mystr"</span>;
Console.WriteLine(<span style="color: #b58900;">object</span>.ReferenceEquals(str1, str2));
</pre>



<p>
<span style="text-decoration:underline;">output</span>
</p>
<p>
True
</p>
<p>
If some one locks on say string instance strFromA with literal string
"syncString" and other class or function unawarely locks on its
local string instance say strFromB with the same literal i.e
"syncString". At this stage deadlock can occur and both are locking on
literal "syncString".
</p>




<pre class="src src-csharp"><span style="color: #859900;">class</span> <span style="color: #b58900;">A</span>
{
   <span style="color: #268bd2;">func</span>()
   {
     <span style="color: #b58900;">string</span> <span style="color: #268bd2;">strFromA</span> = <span style="color: #2aa198;">"syncString"</span>;
     <span style="color: #268bd2;">lock</span>(<span style="color: #859900;">this</span>){strFromA)
       .....
     }
   }
} 

<span style="color: #859900;">class</span> <span style="color: #b58900;">B</span>
{  
  <span style="color: #268bd2;">func</span>()
  {
    <span style="color: #b58900;">string</span> <span style="color: #268bd2;">strFromB</span> = <span style="color: #2aa198;">"syncString"</span>;
     <span style="color: #268bd2;">lock</span>(<span style="color: #859900;">this</span>){strFromB)
       .....
     }
    }
  }
} 
</pre>




</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Circular Wait </h2>
<div class="outline-text-2" id="text-6">



<p>
Thread X acquired lock locka and waiting to acquire lock lockb ,
thread Y acquired lock lockb and waiting to acquire lock lockc, 
thread Z acquired lock lockc and waiting to acquire lock locka.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> When a thread terminated ungracefully after acquiring the monitor and without releasing  it. </h2>
<div class="outline-text-2" id="text-7">




<hr/>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-26 13:54:02 </p>
</div>
</div>
</body>
</html>
